#ifndef __BSP_PWM_H
#define __BSP_PWM_H

#include "bsp_core.h" // 包含所有的枚举定义

/* =======================================================
 * API：PWM 初始化
 * 参数：无
 * ======================================================= */
void bsp_pwm_init(void);

/* =======================================================
 * API：设置指定 PWM 通道的高电平脉宽时间 (单位：微秒 us)
 * 参数：ch - PWM 通道枚举 (如 BSP_PWM_THRUSTER_1)
 * pulse_us - 高电平微秒数 (如 1500 代表中位停止)
 * ======================================================= */
void bsp_pwm_set_pulse_us(bsp_pwm_ch_t ch, uint16_t pulse_us);

/* =======================================================
 * API：设置指定 PWM 通道的占空比 (单位：百分比 %)
 * 参数：ch - PWM 通道枚举 (如 BSP_PWM_LIGHT_1)
 * duty - 占空比 0.0f ~ 100.0f
 * ======================================================= */
void bsp_pwm_set_duty(bsp_pwm_ch_t ch, float duty);

#endif // __BSP_PWM_H